Repository: mediaexplorer74/Windows-Mobile-Browser-Streaming
Catalog: Src/BrowserClient/Strings/*/Resources.resw
Source language: en_us
Languages: ru_ru

# About.Text
source: About: Lines Browser
ru_ru: О программе: Браузер Линии

# OriginalIdea.Text
source: Original idea —
ru_ru: Оригинальная идея —

# WelcomeText.Text
source: Welcome
ru_ru: Добро пожаловать

# SettingsPage_LanguageLabel.Text
source: Language
ru_ru: Язык

# EN.Text
source: English
ru_ru: English — Английский

# RU.Text
source: Russian — Русский
ru_ru: Русский

# Community.Text
source: Join our community
ru_ru: Присоединяйтесь к нашему сообществу

# Developer.Text
source: Developer
ru_ru: Разработчик

# LinksOpenInDefaultBrowser.Text
source: All links will be opened in external browser by default
ru_ru: Все ссылки будут открыты в браузере по умолчанию

# NothingErr.Text
source: Looks like here is nothing to see
ru_ru: Похоже на то, что тут ничего нет

# QuestionSettings.Text
source: Do you have any questions?
ru_ru: У вас появились вопросы?

# RegLang.Text
source: Region+Language
ru_ru: Язык+Регион

# SystemInfo.Text
source: System info
ru_ru: Информация о системе

# Thanks.Text
source: Special thanks:
ru_ru: Отдельное спасибо:

# Version.Text
source: Version
ru_ru: Версия

# Wiki.Text
source: Visit the official wiki
ru_ru: Посетите официальную вики

# Back.Text
source: Back
ru_ru: Назад

# Forward.Text
source: Forward
ru_ru: Вперед

# Home.Text
source: Home
ru_ru: Главная

# Settings.Text
source: Settings
ru_ru: Параметры

# Add.Text
source: Add
ru_ru: Добавить

# Tabs.Text
source: Tabs
ru_ru: Вкладки

# DisplayMore.ToolTipService.ToolTip
source: Display more settings
ru_ru: Показать больше настроек

# Pages.ToolTipService.ToolTip
source: View pages
ru_ru: Открытые вкладки

# Close.Label
source: Close
ru_ru: Закрыть

# NewTab.Label
source: New tab
ru_ru: Новая вкладка

# StaticMode.Label
source: Static mode
ru_ru: Статичный режим

# AudioServerAddressInvalid
source: Invalid audio server address format. Use ws://<IPv4-address>:<port>.
ru_ru: Неверный формат адреса для сервера передающего звук. Убедитесь, что вы используете формат "ws://<IPv4-адрес>:<порт>."

# AudioServerAddressTextBox.PlaceholderText
source: Address will be filled automatically if you don't type something manually.
ru_ru: Поле будет заполнено автоматически, если вы не взаимодействовали с ним

# AudioStreaming.Text
source: Audio streaming
ru_ru: Стриминг звука

# AudioStreamingEnabled.Content
source: Enable audio streaming
ru_ru: Использовать передачу звука

# AutomaticallyConnect.Content
source: Connect to server automatically when app is launch
ru_ru: Подключаться к этому серверу автоматически, когда приложение запускается

# BetaTestString
source: Beta
ru_ru: Бета

# Connect.Text
source: Connect
ru_ru: Подключиться

# HideAdditionalSettings
source: Show less settings
ru_ru: Показать меньше настроек

# HowDoesItWorkQ.Text
source: How does it work?
ru_ru: Как это работает?

# ReturnToDefault.ToolTipService.ToolTip
source: Return value to default
ru_ru: Сбросить до значений по умолчанию

# ServerAddress.Text
source: Server address
ru_ru: Адрес сервера

# ServerAddressInvalid
source: Invalid server address format. Use ws://<IPv4-address>:<port>.
ru_ru: Неверный формат адреса сервера. Убедитесь, что вы используете формат "ws://<IPv4-адрес>:<порт>."

# ShowAdditionalSettings
source: Show more settings
ru_ru: Показать больше настроек

# WhatINeedToDoQ.Text
source: What I need to do for start surfing the web?
ru_ru: Что мне нужно сделать, чтобы начать путешествие в сети Интернет?

# AudioServerAddress.Text
source: Audio server address
ru_ru: Адрес сервера для передачи звука

# AudioServerNotConnected
source: Audio server isn't connected
ru_ru: Сервер для передачи звука не подключен

# CancelButton.Content
source: cancel
ru_ru: отмена

# Connection.Text
source: Connection
ru_ru: Текущее подключение

# ConnectState1
source: Connecting
ru_ru: Подключение

# ConnectState2
source: Connection error
ru_ru: Ошибка подключения

# ConnectState3
source: Connection complete
ru_ru: Подключение завершено

# ContinueAnywayButton.Content
source: continue anyway
ru_ru: продолжить в любом случае

# Disconnect.Content
source: Disconnect
ru_ru: Отключиться

# DisconnectText.Text
source: You can disconnect from server to change server settings. Start connection page will be opened after that.
ru_ru: Вы можете отключиться от сервера, чтобы изменить настройки подключения. Вы будете моментально перенаправлены на страницу изменения настроек подключения

# ErrorHappensTitle
source: Something went wrong
ru_ru: Что-то пошло не так

# ErrorHelperMessage
source: If errror persist, contact app support.
ru_ru: Если ошибка повторится, свяжитесь с поддержкой приложения

# ErrorHelperNotCriticalMessage
source: That error isn't critical. You can continue using application, but audio features may be disabled. Press "continue anyway" button to continue without audio features.
ru_ru: Эта ошибка не является критичной. Вы можете продолжить использование приложения, но функции передачи звука будут отключены. Нажмите "продолжить в любом случае", чтобы продолжить без использования функций передачи звука.

# ErrorHelperTextBasic
source: There is unable to find the text related to this error code.
ru_ru: Невозможно найти текст сопоставленный этому коду ошибки

# RetryButton.Content
source: retry
ru_ru: повторить попытку

# WorkingMessage
source: Please, wait while we're connect you to server. It's won't take long.
ru_ru: Пожалуйста, подождите. Сейчас мы подключим вас к серверу. Это не займет много времени.

# WorkInProgress
source: Work are underway
ru_ru: Идет работа над этим

# AudioDisconnect
source: Audio server was disconnected
ru_ru: Сервер для передачи звука был отключен

# AudioDisconnectMessage
source: Something went wrong and connection will be closed.<br>We're collected some information about the problem:
ru_ru: Что-то пошло не так и соединение было разорвано.<br>Мы собрали следующую информацию о проблеме:

# DisconnectTitle.Text
source: Disconnection
ru_ru: Отключение

# AppName
source: Lines Browser
ru_ru: Браузер Линии

# AppDescription
source: Lines Browser is a "Browser as a Service" solution designed to bring the modern web to legacy devices running Windows 10 Mobile. Unlike other browsers, Lines Browser does not rely on the outdated EdgeHTML engine. To use Lines Browser, you'll need to set up your Windows 10 or 11 PC with the Server Deployment Assistant. Your phone and PC must be on the same local network, or you can configure an external IPv4 address via your internet provider.
ru_ru: Браузер Линии — это решение формата «Browser as a Service», которое позволяет пользоваться современным Интернетом на устройствах с Windows 10 Mobile. В отличие от других браузеров для этой платформы, Браузер Линии не использует устаревший движок EdgeHTML. Для работы требуется компьютер с Windows 10 или 11 с запущенным Ассистентом Развертывания Сервера, находящийся в одной сети с телефоном.

# AppShortName
source: L-Browser
ru_ru: Л-Браузер
